Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-5-9.tmx
Source language: bo
Languages: en

source: ལྷ་མ་ཡིན་གྱི་སྒྱུས་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་རབ་ཏུ་སྟོན་ཅིང་ཆུ་འཛིན་ཆེན་པོ་ཡོངས་སུ་བསྐྱམ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་སྟོང་རབ་ཏུ་བསྐྱོད་པ་དང་། རིའི་རྒྱལ་པོ་ཆེན་པོ་ཐམས་ཅད་འཐབ་པར་བྱ་བ་དང་། ལྷའི་གནས་ཐམས་ཅད་ཡོངས་སུ་བསྐྱོད་པ་དང་། བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཟིལ་གྱིས་གནན་པ་དང་། བདུད་ཀྱི་སྡེ་ཐམས་ཅད་རབ་ཏུ་གདུལ་བ་དང་། ང་རྒྱལ་དང་རློམ་པ་དང་དྲེགས་པ་ཐམས་ཅད་རབ་ཏུ་གཞོམ་པ་དང་། གནོད་པར་སེམས་པའི་སེམས་བཟློག་ཅིང་དགའ་བར་བྱ་བ་དང་། འཐོ་འཚམ་པའི་སེམས་ཕྱིར་བཟློག་པར་བྱ་བ་དང་། སེམས་ཅན་རྣམས་ཀྱིས་མི་དགེ་བའི་ཆོས་རབ་ཏུ་ཞི་བར་བྱ་བ་དང་། ཉོན་མོངས་པའི་རི་རྣམ་པར་གཏོར་བ་དང་། ཉོན་མོངས་པའི་ཐབ་མོ་ཤིན་ཏུ་ཞི་བར་བྱ་བ་དང་། ལྷ་མ་ཡིན་གྱི་སྒྱུས་རྣམ་པར་འཕྲུལ་པ་དང་། རྣམ་པར་རྩེ་བ་སྣ་ཚོགས་ཀྱིས་སེམས་ཅན་རྣམས་སྐྱོ་བར་བྱ་བ་དང་། སྡིག་པ་ལས་གྱེན་དུ་བསྐྱོད་པ་དང་། འཁོར་བས་འཇིགས་པར་བྱ་བ་དང་། སྲིད་པའི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་ནས་གྱེན་དུ་བསྐྱོད་དེ་གནས་མེད་པ་ལ་རབ་ཏུ་གནས་པར་བྱ་བ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ལ་སེམས་ཅན་རྣམས་རབ་ཏུ་དགོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམ་པར་དག་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རབ་ཏུ་དགོད་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་རབ་ཏུ་གཟུང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་ཚུལ་སྣང་བ་ཡོངས་སུ་བསྐྱེད་པ་དང་། ཆོས་ཀྱི་ཚུལ་རྣམ་པར་དགོད་པ་སྣ་ཚོགས་ཀྱིས་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ཞིང་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པར་བྱེད་པ།
en: destroying all pride, conceit, and arrogance in the world; repelling malicious motivations and then bringing happiness; banishing motivations toward violence; bringing the bad qualities of beings to an end; disintegrating the mountains of the kleśas; bringing the battle with the kleśas to an end; disturbing beings through enjoying manifesting various asura conjurations;

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་།
en: causing them to shrink from bad actions; causing them to be terrified of saṃsāra; causing them to depart from the states of existence and settle in being without an abode; establishing beings in the aspiration to enlightenment; causing them to purify the bodhisattva conduct of the bodhisattvas; establishing them in the perfections of the bodhisattvas; causing them to enter the bodhisattva bhūmis; giving rise to the illumination of the way of the Buddhadharma of the bodhisattvas;

source: །རྒྱབ་ཀྱི་གཞུང་ནས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་མང་པོ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་བདག་ཏུ་མངོན་པར་ཞེན་པ་རྣམས་ལ་བདག་མེད་པ་དང་། སེམས་ཅན་མེད་པ་ཡོངས་སུ་བརྗོད་པ་བྱེད་ཅིང་།
en: and establishing beings in the various ways of the Dharma. Sudhana saw, issuing forth from Sāgara­dhvaja’s back, a multitude of śrāvakas and pratyeka­buddhas as numerous as the atoms in countless buddha realms and pervading the realm of phenomena. The śrāvakas and pratyeka­buddhas were teaching the absence of a self and the absence of a being to those beings who were to be guided by them and had attachment to a self;

source: རྟག་པར་མངོན་པར་ཞེན་པ་རྣམས་ལ་འདུ་བྱེད་ཐམས་ཅད་མྱི་རྟག་པར་ཡོངས་སུ་བསྟན་པ་དང་། འདོད་ཆགས་ཀྱི་སྤྱོད་པ་ཅན་རྣམས་ལ་མྱི་སྡུག་པ་དང་། ཞེ་སྡང་གི་སྤྱོད་པ་ཅན་རྣམས་ལ་བྱམས་པ་དང་། གཏི་མུག་གི་སྤྱོད་པ་ཅན་རྣམས་ལ་རྐྱེན་ལས་བྱུང་བའི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་བརྗོད་པ་དང་། ཆ་མཉམ་པའི་སྤྱོད་པ་ཅན་རྣམས་ལ་ཡེ་ཤེས་ཀྱི་ཡུལ་དང་ལྡན་པའི་ཆོས་ཀྱི་ཚུལ་མངོན་པར་བསྟན་པ་དང་། ཡུལ་ལ་མངོན་པར་དགའ་བ་རྣམས་ལ་གནས་མེད་པ་རབ་ཏུ་བརྗོད་པ་དང་། ཞི་བ་ལ་གནས་སུ་སེམས་པ་རྣམས་ལ་སྨོན་ལམ་གྱི་ཁྱད་པར་གྱིས་སྤྲོ་བ་བསྐྱེད་པ་དང་། ཕྱོགས་ཀྱི་རྒྱུད་དང་སྒོ་ཐམས་ཅད་དུ་ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོའི་རྒྱུད་དང་། སྒོ་ཐམས་ཅད་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་བརྗོད་པར་བྱེད་ཅིང་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་།
en: they were teaching the impermanence of the composite to those who were attached to permanence, ugliness to those who had the conduct of desire, love to those who had the conduct of anger, and dependent origination to those who had the conduct of ignorance; and they were teaching the way of the Dharma that has the range of wisdom to those who had equal amounts of those conducts, teaching the absence of a basis to those who delighted in the range of sensory perceptions, inspiring higher aspirations in those who intended to dwell in peace, and illuminating the gateways to all directions and all the gateways of the ocean of ways in the Dharma.

source: །ཕྲག་པའི་ལྷུན་གཉིས་ལས་གནོད་སྦྱིན་དང་། སྲིན་པོའི་དབང་པོ་དབྱིབས་སྣ་ཚོགས་དང་ལྡན་ཞིང་ལུས་མི་སྡུག་པ་ཁ་དོག་དང་ཆུ་ཞེང་སྣ་ཚོགས་ཅན་སྤྱོད་ལམ་གྱི་རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་པ།
en: Sudhana saw, issuing forth from Sāgara­dhvaja’s shoulder blades, yakṣa and rākṣasa lords as numerous as the atoms in countless buddha realms, having various forms, peculiar bodies of various colors and widths, various kinds of mendicancy, and various kinds of mounts.

source: བཞོན་པ་སྣ་ཚོགས་ལ་ཞོན་པ། འཁོར་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ། སེམས་ཅན་གྱི་ཁམས་ཡོངས་སུ་བསྐྱང་བ་ལ་བརྩོན་པ། འོད་སྣ་ཚོགས་ཀྱིས་སྣང་བར་བྱ་བ་ལ་བརྩོན་པ། དབྱངས་སྣ་ཚོགས་རབ་ཏུ་སྒྲོག་པ།
en: They were accompanied by various kinds of entourages, spreading throughout the realm of phenomena, and they were engaging in protecting the realm of beings, engaging in emitting different kinds of light, singing various songs, and filling the directions and intermediate directions of space with the accomplishment of various distinct methods as numerous as the atoms in countless buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས་ཐབས་མངོན་པར་བསྒྲུབ་པ་སྣ་ཚོགས་མ་འདྲེས་པས་ཕྱོགས་དང་ཕྱོགས་མཚམས་ཀུན་གྱི་ནམ་མཁའ་རྒྱས་པར་འགེངས་ཤིང་དགེ་བའི་སྤྱོད་པ་ཐམས་ཅད་ཡོངས་སུ་བསྲུང་བ་དང་། འཕགས་པའི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཡོངས་སུ་བསྲུང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བ་དང་། ལག་ན་རྡོ་རྗེའི་ལས་ཀྱིས་ཡང་དག་པར་སོང་བ་དང་། ཡང་དག་པར་ཞུགས་པ་ཐམས་ཅད་ཡོངས་སུ་བསྲུང་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ལ་མཆོད་པ་དང་རིམ་གྲོ་བྱ་བ་དང་། སེམས་ཅན་ལོག་པར་ལྟུང་བ་རྣམས་ཀྱི་ངན་སོང་གི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་ནད་དང་། གནོད་པ་དང་འཇིགས་པ་ཐམས་ཅད་ཞི་བར་བྱེད་པའི་དོན་དུ་བརྩོན་པ།
en: They did this so as to guard all good conduct, so as to guard all the assemblies of the āryas, so as to care for all bodhisattvas, so as to protect through the activity of Vajrapāṇi all those who are perfectly practicing the perfect way, so as to render various services to and make various offerings to all the buddhas, and so as to bring fallen beings back from the pathway to the lower existences.

source: སེམས་ཅན་གྱི་དོན་བྱ་བས་འཇིག་རྟེན་ཡོངས་སུ་བསྐྱང་བ་ལ་བརྩོན་པ་རྣམས་བསོད་ནམས་དང་། ཡེ་ཤེས་ཀྱི་འཁོར་ལོ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོའི་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། ཕས་ཀྱི་རྒོལ་བའི་འཁོར་ཚར་གཅོད་པར་བྱེད་ཅིང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པར་བྱེད་པ།
en: They were engaged in bringing all illness, harm, and danger in all worlds to an end, were engaged in protecting in the world all activities beneficial to beings, were causing the wheel of gathering merit and wisdom to be completed, were causing the wheel of the Dharma to be turned, and were destroying the wheel of the adversaries.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །མདུན་གྱི་ལྟོ་ནས་མྱི་འམ་ཅིའི་དབང་པོ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མིའམ་ཅིའི་དབང་པོའི་བུ་མོའི་འཁོར་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཅན་དང་། དྲི་ཟའི་དབང་པོ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད། དྲི་ཟའི་དབང་པོའི་བུ་མོའི་འཁོར་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཅན་དག་བྱུང་ནས། ལྷའི་རོལ་མོ་བརྒྱ་སྟོང་གྲངས་མེད་པའི་སྒྲ་སྙན་པ་དང་། གླུའི་དབྱངས་ཀྱིས་ཆོས་ཀྱི་རང་བཞིན་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་བསྟོད་པ་བརྗོད་པ་བྱེད་ཅིང་། བྱང་ཆུབ་ཀྱི་སེམས་ཡོངས་སུ་བསྔགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་བརྗོད་པ་དང་། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་སྒོ་ཐམས་ཅད་ལ་མངོན་པར་བསྟོད་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོའི་སྒོ་ཐམས་ཅད་དུ་འཇུག་པ་དང་། རྣམ་པར་འཕྲུལ་པའི་སྒོ་ཐམས་ཅད་ལ་མངོན་པར་སྤྲོ་བར་བྱ་བ་དང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་སྒོ་ཐམས་ཅད་ཡོངས་སུ་བརྗོད་པ་དང་། སངས་རྒྱས་ཀྱིས་བསྟན་པའི་སྒོ་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བ་དང་། སེམས་ཅན་གྱི་སྒོ་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་སྒོ་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། ཆོས་ཀྱི་སྒོ་ཐམས་ཅད་མངོན་པར་བསྟན་པར་བྱ་བ་དང་། སྒྲིབ་པའི་སྒོ་ཐམས་ཅད་རྣམ་པར་བཟློག་པར་བྱ་བ་དང་། དགེ་བའི་རྩ་བའི་སྒོ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱེད་པ་བྱེད་ཅིང་།
en: Sudhana saw, issuing forth from Sāgara­dhvaja’s stomach, kinnara lords as numerous as the atoms in countless buddha realms, accompanied by entourages of countless hundreds of thousands of kinnara maidens and gandharva lords as numerous as the atoms in countless buddha realms, accompanied by entourages of countless hundreds of thousands of gandharva maidens, spreading throughout the realm of phenomena, with the sounds of countless hundreds of thousands of musical instruments and the singing of songs that had the nature of the Dharma, eulogizing the aspiration to enlightenment, elucidating bodhisattva conduct, praising all the gateways to complete buddhahood, causing entry into all the gateways of the Dharma, causing aspiration for all the gateways to miracles, elucidating all the gateways to nirvāṇa, causing the acquisition of all the gateways to the Buddha’s teaching, causing joy for all the gateways to beings, causing the purification of all buddha realms, causing the elucidation of all the Dharma gateways, causing all the gateways to obscuration to be repelled, and causing all the gateways to the roots of merit to be developed.

source: ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །ཁའི་སྒོ་ནས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་རིན་པོ་ཆེ་བདུན་དང་ལྡན་ཞིང་སྟོབས་ཀྱི་ཡན་ལག་བཞིའི་ཚོགས་ཀྱི་འཁོར་དང་ལྡན་པ་བྱུང་ནས།
en: Sudhana saw, issuing forth from Sāgara­dhvaja’s mouth, cakravartins as numerous as the atoms in countless buddha realms, possessing an entourage of the seven jewels and the four divisions of the army; spreading throughout the ten directions of the realm of phenomena and radiating a display of the light rays of great generosity; emitting a profusion of all precious materials; distributing a profusion of all precious jewels; making the poor wealthy; turning the world away from killing; establishing beings in a loving motivation; dissuading them from taking what has not been given; bestowing on them a quintillion maidens adorned with jewelry; deterring them from sexual misconduct; establishing them in celibacy; turning them away from lying; exhorting them to avoid deception; turning them away from slanderous words; inspiring them toward creating harmony between others; turning the world away from harsh speech; inspiring them to speak pleasantly and gently;

source: སྦྱིན་པ་ཆེན་པོའི་འོད་ཟེར་གྱི་རྒྱན་རབ་ཏུ་འགྱེད་ཅིང་རིན་པོ་ཆེའི་འབྱུང་གནས་ཐམས་ཅད་ཡོངས་སུ་གཏང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེའི་ཚོགས་ཐམས་ཅད་སྦྱིན་པ་དང་། དབུལ་པོ་རྣམས་ནོར་དང་ལྡན་པར་བྱ་བ་དང་། སྲོག་གཅོད་པ་ལས་འཇིག་རྟེན་རྣམ་པར་བཟློག་པ་དང་། བྱམས་པའི་སེམས་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། མ་བྱིན་པར་ལེན་པ་དང་། རབ་ཏུ་དབྲལ་བ་དང་། རྒྱན་གྱིས་ཤིན་ཏུ་བརྒྱན་པའི་བུ་མོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཡོངས་སུ་གཏང་བ་དང་། འདོད་པས་ལོག་པར་གཡེམ་པ་ལས་རྣམ་པར་བཟློག་པ་དང་། ཚངས་པའི་སྤྱོད་པ་ལ་རབ་ཏུ་དགོད་པ་དང་། བརྫུན་དུ་སྨྲ་བ་ལས་རྣམ་པར་བཟློག་པ་དང་། བསླུ་བ་མྱེད་པ་ལ་གཞོལ་བར་རབ་ཏུ་དགོད་པ་དང་། ཕྲ་མའི་ཚིག་ལས་རྣམ་པར་བཟློག་པ་དང་། གཞན་འདུམ་པར་བརྩོན་པའི་ཚིག་རབ་ཏུ་བརྗོད་པ་དང་། ཞེ་གཅོད་པའི་ཚིག་ལས་འཇིག་རྟེན་རྣམ་པར་བཟློག་པ་དང་། འཇམ་ཞིང་ཡིད་དུ་འོང་བའི་ཚིག་རབ་ཏུ་བརྗོད་པ་དང་། གནོད་པའི་ཆོས་དང་ལྡན་པའི་བྱུང་རྒྱལ་དུ་སྨྲ་བ་ལས་སེམས་ཅན་རྣམ་པར་བཟློག་པ་དང་། དོན་ཟབ་མོའི་ཚིག་རབ་ཏུ་དབྱེ་བ་གདོན་མི་ཟ་བ་ལ་ཡང་དག་པར་དགོད་པ་དང་། ངག་གི་ཉེས་པ་ཐམས་ཅད་ལས་འཇིག་རྟེན་རྣམ་པར་བཟློག་པ་དང་། སྙིང་རྗེ་དང་ལྡན་པའི་ཚིག་རབ་ཏུ་བརྗོད་པར་བྱ་བ་དང་། འཇིག་རྟེན་གྱི་སྙིང་གི་དྲི་མ་ཡོངས་སུ་སེལ་ཅིང་འདོད་པ་ཆུང་བ་དང་། ཆོག་ཤེས་པ་ལ་བརྩོན་པར་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། ཆགས་སེམས་ལས་འཇིག་རྟེན་རྣམ་པར་བཟློག་པ་དང་། གཞན་གྱི་སེམས་ཀྱི་རྒྱུད་དགའ་བར་བྱེད་པ་ལ་རབ་ཏུ་དགོད་པ་དང་། ལྟ་བའི་དྲ་བ་ཐམས་ཅད་ལས་འཇིག་རྟེན་རབ་ཏུ་གདོན་པ་དང་། ཡིད་གཉིས་ཀྱི་ར་བ་ཐམས་ཅད་རྣམ་པར་གཏོར་བ་དང་། ཐེ་ཙོམ་གྱི་སྤོ་ཐམས་ཅད་ཡང་རབ་ཏུ་གཞོམ་པ་དང་། ནེམ་ནུར་དང་སོམ་ཉིའི་རབ་རིབ་ཡོངས་སུ་བསྩལ་བ་དང་། ཆོས་རྣམ་པར་དབྱེ་བའི་འཇིག་རྟེན་དུ་རབ་ཏུ་དབྱེ་བ་དང་། རྐྱེན་ལས་བྱུང་བ་རབ་ཏུ་བརྗོད་པ་དང་། རང་བཞིན་གྱིས་བདེན་པའི་ཚུལ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། སྒྲིབ་པ་མེད་པའི་ཚུལ་ལ་གཟུང་བ་དང་། སངས་རྒྱས་ཀྱི་དོན་གྱི་ཚུལ་སྣ་ཚོགས་བརྗོད་པ་བྱེད་ཅིང་།
en: turning beings away from worthless, careless, meaningless speech and directing them to speech with definitive categories of profound words; turning the world away from all bad speech and inspiring it to speak with words of compassion; removing the heart’s stains within the world; directing beings to contentment and few needs; turning the world away from malice; directing it to bring happiness to the minds of others; raising the world up out of the net of wrong views; demolishing the walls of all doubt; causing the mountain peak of all uncertainty to tumble down; clearing away the darkness of indecisive thinking; separating for the world the categories of phenomena; describing dependent origination; guiding beings into the way to the true nature; making them turn away from obscurations; causing them to enter the way free of obscuration; and inspiring them on the way to the goal of buddhahood.

source: ཕྱོགས་བཅུའི་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །མིག་གཉིས་ནས་ཉི་མའི་དཀྱིལ་འཁོར་བརྒྱ་སྟོང་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་སྟེ།
en: Sudhana saw, issuing forth from Sāgara­dhvaja’s eyes, hundreds of thousands of sun disks as numerous as the atoms in countless buddha realms, filling the realm of phenomena of all beings and illuminating all the great hells, dispelling darkness in the world; eliminating the darkness of ignorance within beings;

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཐམས་ཅད་ཡོངས་སུ་སྣང་བར་བྱེད་ཅིང་འཇིག་རྟེན་གྱི་མུན་པ་ཆེན་པོ་སེལ་བ་དང་། སེམས་ཅན་རྣམས་ཀྱི་གཏི་མུག་གི་རབ་རིབ་སེལ་བ་དང་། གྲང་བའི་སེམས་ཅན་དམྱལ་བ་ན་འཁོད་པའི་སེམས་ཅན་རྣམས་ཀྱི་གྲང་བའི་སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་བྱེད་པ་དང་། སའི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་ཁ་དོག་དཀར་པོ་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། གསེར་གྱི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་བཻ་ཌཱུརྱའི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། བཻ་ཌཱུརྱའི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་དངུལ་གྱི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། དངུལ་གྱི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་གསེར་གྱི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། གསེར་གྱི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་ཤེལ་གྱི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། གསེར་གྱི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་མུ་ཏིག་དམར་པོའི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། ཨ་སྨྲ་གརྦྷའི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་གསེར་གྱི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། གསེར་གྱི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་ཨ་སྨ་གརྦྷའི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། ཨིན་དྲ་ནཱི་ལའི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཉི་མའི་སྙིང་པོའི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། རིན་པོ་ཆེའི་རྒྱལ་པོ་ཉི་མའི་སྙིང་པོའི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཨིན་དྲ་ནཱི་ལའི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། མུ་ཏིག་དམར་པོའི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཟླ་བའི་འོད་ཟེར་གྱི་དྲ་བ་དང་དཀྱིལ་འཁོར་གྱི་སྙིང་པོའི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། རིན་པོ་ཆེའི་རྒྱལ་པོ་ཟླ་བའི་འོད་ཟེར་གྱི་དྲ་བ་དང་དཀྱིལ་འཁོར་གྱི་སྙིང་པོའི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་མུ་ཏིག་དམར་པོའི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། རིན་པོ་ཆེ་གཅིག་གི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རང་བཞིན་གྱི་ཞིང་རྣམས་སུ་འོད་རིན་པོ་ཆེ་གཅིག་གི་ཁ་དོག་ཅན་རབ་ཏུ་འགྱེད་པ་དང་། དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་སེམས་ཅན་གྱི་དོན་ཚད་མེད་པ་ལ་བརྩོན་ཞིང་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་།
en: bringing to an end the suffering of cold experienced by the beings in the cold hells; shining white light rays over the realms that are made of earth; shining light rays the color of beryl over the realms that are made of gold; shining light rays the color of gold over the realms that are made of beryl; shining light rays the color of silver over the realms that are made of gold; shining light rays the color of gold over the realms that are made of silver; shining light rays the color of crystal over the realms that are made of gold; shining light rays the color of gold over the realms that are made of crystal; shining light rays the color of white coral over the realms that are made of gold; shining light rays the color of gold over the realms that are made of white coral; shining light rays the color of gold over the realms that are made of red pearls; shining light rays the color of red pearls over the realms that are made of gold; shining light rays the color of gold over the realms that are made of emerald; shining light rays the color of emerald over the realms that are made of gold; shining light rays the color of sunstones, the kings of jewels, over the realms that are made of sapphire; shining light rays the color of sapphires, the kings of jewels, over the realms that are made of sunstones, the kings of jewels; shining light rays the color of the kings of jewels, the essences of the disk of the aggregation of moonstones, over the realms that are made of red pearls; shining light rays the color of red pearls over the realms that are made of the kings of jewels, the essences of the disk of the aggregation of moonstones; shining light rays that have the colors of various kinds of jewels over the realms that are made of a single kind of jewel; and shining light rays that have the color of a single kind of jewel over the realms that are made of various kinds of jewels; thus engaging in measureless activities for beings within all the assemblies of pupils of bodhisattvas.

source: །སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་ནས་ཟླ་བ་མང་པོ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས། ལྷའི་དབང་པོ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་ཅིང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་འདོད་པའི་དགའ་བ་རྣམ་པར་བཟློག་པ་དང་། སངས་རྒྱས་བལྟ་བར་དགའ་བ་ལ་རྗེས་སུ་བསྔགས་པ་བྱེད་ཅིང་། སེམས་ཅན་ཚད་མྱེད་པ་གདུལ་བ་ལ་བརྩོན་པར་ཕྱོགས་བཅུའི་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པར་མཐོང་ངོ་།
en: Sudhana saw, issuing forth from the ūrṇā hair between Sāgara­dhvaja’s eyebrows, a multitude of moons as numerous as the atoms in countless buddha realms, filling the ten directions of the realm of phenomena and overpowering all lords of devas, turning all the world away from delighting in desires, praising delight in seeing the buddhas, and dedicated to guiding measureless beings.

source: །འཕྲལ་བ་ནས་ཚངས་པ་ཆེན་པོ་སྤྱོད་ལམ་རབ་ཏུ་ཞི་བ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་བ་ནས། ཚངས་པའི་དབྱངས་སུ་བརྗོད་དེ། སངས་རྒྱས་ཐམས་ཅད་ལ་གསོལ་བ་གདབ་པ་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་བྱ་བ་བྱེད་ཅིང་སེམས་ཅན་གྱི་དོན་ཚད་མེད་པ་ལ་བརྩོན་པར་ཕྱོགས་བཅུའི་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་།
en: Sudhana saw, issuing forth from the Sāgara­dhvaja’s forehead, Mahābrahmās as numerous as the atoms in countless buddha realms, filling the ten directions of the realm of phenomena, who had a peaceful deportment, spoke with the voice of Brahmā, supplicated all the buddhas for instruction, eulogized all the buddhas, gladdened all bodhisattvas, and were dedicated to measureless benefit for beings.

source: །མགོ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས། ཁ་དོག་དང་དབྱིབས་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པའི་ལུས་ཡོངས་སུ་སྟོན་ཅིང་། དཔེ་བྱད་བཟང་པོས་རྣམ་པར་བྲིས་པའི་ལུས་རབ་ཏུ་སྟོན་པ་དང་། འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྤྲིན་མཐའ་དང་དབུས་མེད་པ་རབ་ཏུ་དགྱེ་བ་དང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ནས་བཟུང་སྟེ།
en: Sudhana saw, issuing forth from Sāgara­dhvaja’s head, bodhisattvas as numerous as the atoms in countless buddha realms, filling in each instant of mind the ten directions of the realm of phenomena, manifesting bodies that had various colors, forms, and adornments, revealing bodies beautified by the features of a great being, and emanating infinite clouds of halos. From all their pores there commenced the emanation of the past bodhisattva conduct of all buddhas, revealing clouds of the processes of acts of generosity with their givers, recipients, and gifts; revealing an ocean of the previous practices of the various perfections; describing the conduct of generosity to the world;

source: གཏོང་བ་དང་ལེན་པ་དང་། དངོས་པོ་ཡོངས་སུ་གཏོང་བའི་སྤྲིན་མང་པོ་རབ་ཏུ་དགྱེ་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་སྣ་ཚོགས་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་ཡོངས་སུ་བསྟན་པ་དང་། སྦྱིན་པའི་སྤྱོད་པ་འཇིག་རྟེན་དུ་ཡོངས་སུ་བརྗོད་པ་དང་། སེར་སྣའི་དྲི་མ་རྣམ་པར་བཟློག་པ་དང་། ཆགས་པ་ཐམས་ཅད་སྤང་བ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། འཇིག་རྟེན་རིན་པོ་ཆེ་སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པར་བྱིན་གྱིས་བརླབ་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། མཚན་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་ཡང་དག་པར་བརྗོད་པ་དང་། སངས་རྒྱས་ཀྱི་མཚན་འབྱུང་བའི་རྒྱུ་སྟོན་པ་བྱེད་པ་མཐོང་ངོ་།
en: averting the stains of greed; bringing beings to the renunciation of all attachments; blessing worlds with an adorning array of every variety of jewel; establishing beings in the perfection of generosity and then establishing them in the power over necessities; proclaiming the qualities of all characteristics of a supreme being; and teaching the causes for the arising of those features of a buddha.

source: །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བརྗོད་ཅིང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་ཡོངས་སུ་བསྟན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལམ་གྱི་རྒྱུད་དང་ཡུལ་ལས་ཕྱིར་ཕྱོགས་པར་བྱས་ཏེ།
en: Sudhana saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms and were describing the perfection of good conduct manifesting from all their pores, an ocean of the past practice by all the buddhas of the perfection of good conduct.

source: དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་མངོན་དུ་ཕྱོགས་པར་བྱ་བ་དང་། འཇིག་རྟེན་གྱི་འདོད་པ་ལ་རྣམ་པར་སྨད་པ་དང་། འཇིག་རྟེན་གྱི་ཕྱིན་ཅི་ལོག་གི་ལིང་ཏོག་རྣམ་པར་བསལ་བ་དང་། ལོག་པའི་རྣམ་པར་རྟོག་པ་རབ་ཏུ་ཞི་བར་བྱས་ནས་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཁྲིམས་ལ་ཡང་དག་པར་དགོད་པ་དང་། སྙིང་རྗེ་ཆེན་པོའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་བརྗོད་ཅིང་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་ཕྱིར།
en: They were causing all beings to turn away from the entire field of existences and worlds and directing them to the field of the tathāgatas; they were deploring the world of desire; they were removing the cataracts of error in the world; they were bringing an end to erroneous thought and establishing beings in the correct conduct of the bodhisattvas;

source: སངས་རྒྱས་ཀྱི་ལམ་ནན་ཏན་དུ་བྱ་བའི་ཚུལ་ཁྲིམས་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། སྲིད་པའི་ལམ་གྱི་རྒྱུད་རྨི་ལམ་ལྟ་བུར་སེམས་ཅན་རྣམས་ལ་རབ་ཏུ་བརྗོད་ཅིང་།
en: they were describing the correct conduct of great compassion and establishing beings in the correct conduct of practicing the path of the buddhas so that they might attain the correct conduct of the tathāgatas; they were describing to beings how the states of existence are like dreams;

source: རྨི་ལམ་གྱི་ཚུལ་དང་མཉམ་པར་ཡོངས་སུ་གཞོལ་བར་བྱ་བའི་ཕྱིར་ཡུལ་ཡོངས་སུ་འཛིན་པ་དང་ཉོན་མོངས་པ་ལ་དབང་བསྒྱུར་བར་སེམས་ཅན་རྣམས་རབ་ཏུ་དགོད་པ་བྱེད་པ་མཐོང་ངོ་།
en: and they were establishing beings in a state of overpowering the kleśas and attachment to the field of the senses in order that they might attain the state of perceiving all to be the same as the way of dreams.

source: །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས། འཇིག་རྟེན་རྣམས་ལ་མདོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་མངོན་པར་སྟོན་ཅིང་།
en: Sudhana also saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms and were revealing worlds to be golden in color.

source: ཁྲོ་བ་མེད་པ་དང་། འཁྲུག་པ་མེད་པ་དང་། ཤར་གཉེར་བ་མེད་པ་དང་། ཞེ་སྡང་བ་མེད་པ་དང་། ཆུད་གསོན་པ་མེད་པ་དང་། ཁོང་ཁྲོ་བ་མེད་པའི་སེམས་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་ཡོངས་སུ་གཅོད་པའི་ཕྱིར།
en: They were establishing beings in having no anger and no vexation and in states of mind that are without harshness, without hatred, nondestructive, and free of hostility. In order to close the ways to animal wombs, they were manifesting from all their pores clouds of the past practice by the tathāgatas of dedication to the perfection of patience, and they were establishing beings in the power of patience and revealing to beings power over phenomena.
